workspace/projects/036-my-project/results/report_20250103-030257.org
#+TITLE: Project Report
#+AUTHOR: LLEMACS Report Generator
#+DATE: 2025-01-03 03:02:57

* Project Overview
** Project Directory
=/home/ywatanabe/proj/llemacs/workspace/projects/036-my-project=

* Project Structure
#+BEGIN_SRC text
/home/ywatanabe/proj/llemacs/workspace/projects/036-my-project
|-- config
|-- data
|-- logs
|   |-- by_level
|   |   |-- debug.log
|   |   |-- elisp.log
|   |   |-- error.log
|   |   |-- info.log
|   |   |-- prompt.log
|   |   |-- search.log
|   |   |-- success.log
|   |   `-- warn.log
|   `-- logging.log
|-- pm
|   `-- pm.mmd
|-- README.md
|-- requirements.txt
|-- results
|   |-- report_20250103-023419.org
|   |-- report_20250103-023706.org
|   |-- report_20250103-025607.org
|   `-- report_20250103-025730.org
`-- scripts
    `-- plot.py
#+END_SRC

* Recent Activity Logs
#+BEGIN_SRC text
[2025-01-03 02:56:07] Starting plot generation and report creation
[2025-01-03 02:56:07] Executing Python plot script
[2025-01-03 02:56:07] Creating org report
[2025-01-03 02:56:07] Opening report in buffer
[2025-01-03 02:57:30] Starting report generation
#+END_SRC

* Project Management
[[file:../pm/pm.mmd][Project Management Diagram]]

* Project Files
- [[file:../README.md][README]]
- [[file:../scripts/plot.py][Plot Script]]
- [[file:../requirements.txt][Requirements]]

* Generated Reports
- [[file:report_20250103-023419.org][Report 2025-01-03 02:34:19]]
- [[file:report_20250103-023706.org][Report 2025-01-03 02:37:06]]
- [[file:report_20250103-025607.org][Report 2025-01-03 02:56:07]]
- [[file:report_20250103-025730.org][Report 2025-01-03 02:57:30]]
