workspace/projects/036-my-project/results/report_20250103-030257.tex
% Created 2025-01-03 Fri 03:02
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{LLEMACS Report Generator}
\date{2025-01-03 03:02:57}
\title{Project Report}
\hypersetup{
 pdfauthor={LLEMACS Report Generator},
 pdftitle={Project Report},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Project Overview}
\label{sec:orgc9b984f}
\subsection{Project Directory}
\label{sec:orga3cec64}
\texttt{/home/ywatanabe/proj/llemacs/workspace/projects/036-my-project}

\section{Project Structure}
\label{sec:org011d779}
\begin{verbatim}
/home/ywatanabe/proj/llemacs/workspace/projects/036-my-project
|-- config
|-- data
|-- logs
|   |-- by_level
|   |   |-- debug.log
|   |   |-- elisp.log
|   |   |-- error.log
|   |   |-- info.log
|   |   |-- prompt.log
|   |   |-- search.log
|   |   |-- success.log
|   |   `-- warn.log
|   `-- logging.log
|-- pm
|   `-- pm.mmd
|-- README.md
|-- requirements.txt
|-- results
|   |-- report_20250103-023419.org
|   |-- report_20250103-023706.org
|   |-- report_20250103-025607.org
|   `-- report_20250103-025730.org
`-- scripts
    `-- plot.py
\end{verbatim}

\section{Recent Activity Logs}
\label{sec:org987d76e}
\begin{verbatim}
[2025-01-03 02:56:07] Starting plot generation and report creation
[2025-01-03 02:56:07] Executing Python plot script
[2025-01-03 02:56:07] Creating org report
[2025-01-03 02:56:07] Opening report in buffer
[2025-01-03 02:57:30] Starting report generation
\end{verbatim}

\section{Project Management}
\label{sec:org97054bf}
\href{../pm/pm.mmd}{Project Management Diagram}

\section{Project Files}
\label{sec:org1358b42}
\begin{itemize}
\item \href{../README.md}{README}
\item \href{../scripts/plot.py}{Plot Script}
\item \href{../requirements.txt}{Requirements}
\end{itemize}

\section{Generated Reports}
\label{sec:orgaad0769}
\begin{itemize}
\item \href{report\_20250103-023419.org}{Report 2025-01-03 02:34:19}
\item \href{report\_20250103-023706.org}{Report 2025-01-03 02:37:06}
\item \href{report\_20250103-025607.org}{Report 2025-01-03 02:56:07}
\item \href{report\_20250103-025730.org}{Report 2025-01-03 02:57:30}
\end{itemize}
\end{document}
